{
  "jetEngineParts": [
    {
      "name": "Nose",
      "description": "Given the problem of the aerodynamic design of the nose cone section of any vehicle or body meant to travel through a compressible fluid medium (such as a rocket or aircraft, missile or bullet), an important problem is the determination of the nose cone geometrical shape for optimum performance. For many applications, such a task requires the definition of a solid of revolution shape that experiences minimal resistance to rapid motion through such a fluid medium, which consists of elastic particles.",
      "operating_temperature": "15 °C",
      "rpm": 3000,
      "texture_img": "images/parts/nosecone.png"
    },
    {
      "name": "Fan",
      "description": "The fan is the first component in a turbofan. The large spinning fan sucks in large quantities of air. Most blades of the fan are made of titanium. It then speeds this air up and splits it into two parts. One part continues through the \"core\" or center of the engine, where it is acted upon by the other engine components.",
      "operating_temperature": "50 °C",
      "rpm": 4000,
      "texture_img": "images/parts/fanblade.png"
    },
    {
      "name": "Compressor",
      "description": "The compressor is the first component in the engine core. The compressor is made up of fans with many blades and attached to a shaft. The compressor squeezes the air that enters it into progressively smaller areas, resulting in an increase in the air pressure. This results in an increase in the energy potential of the air. The squashed air is forced into the combustion chamber.",
      "operating_temperature": "500 °C",
      "rpm": 6000,
      "texture_img": "images/parts/compresor.png"
    },
    {
      "name": "Combustion",
      "description": "In the combustor the air is mixed with fuel and then ignited. There are as many as 20 nozzles to spray fuel into the airstream. The mixture of air and fuel catches fire. This provides a high temperature, high-energy airflow. The fuel burns with the oxygen in the compressed air, producing hot expanding gases. The inside of the combustor is often made of ceramic materials to provide a heat-resistant chamber",
      "operating_temperature": "1500 °C",
      "rpm": 10000,
      "texture_img": "images/parts/combusture.png"
    },
    {
      "name": "Turbine",
      "description": "The high-energy airflow coming out of the combustor goes into the turbine, causing the turbine blades to rotate. The turbines are linked by a shaft to turn the blades in the compressor and to spin the intake fan at the front. This rotation takes some energy from the high-energy flow that is used to drive the fan and the compressor. The gases produced in the combustion chamber move through the turbine and spin its blades. The turbines of the jet spin around thousands of times. They are fixed on shafts which have several sets of ball-bearing in between them.",
      "operating_temperature": "1400 °C",
      "rpm": 8000,
      "texture_img": "images/parts/turbine.png"
    }
  ]
}
