{
  "jetEngineParts": [
    {
      "name": "shaft",
      "description": "The shaft transfers power from the turbine to the compressor and fan blades. There can be up to 3 shafts allowing different components to spin at different speeds.",
      "requirements": "The shaft material must have high strength.",
      "texture_img": "images/parts/nosecone.png",
      "correctMat": "steel"
    },
    {
      "name": "fan",
      "description": "The large fan blades at the front of a jet engine push air through the engine to provide thrust. They rotate very fast and due to their size, they are subjected to high forces.",
      "requirements": "The fan blades must have excellent strength to weight ratio and have good fatigue strength.",
      "texture_img": "images/parts/fanblade.png",
      "correctMat": "titanium"
    },
    {
      "name": "compressor",
      "description": "The compressor consists of several rows of blades which compress air before combustion. They rotate at high speed, causing high loads and as the air is pressurised, it heats up raising the temperature of the compressor components.",
      "requirements": "Good strength and resistance to fatigue at raised temperatures (although not as hot as turbine). Light weight is an advantage.",
      "texture_img": "images/parts/compresor.png",
      "correctMat": "nickle"
    },
    {
      "name": "combustion",
      "description": "Fuel is burned inside the combustor. These components get very hot and are exposed to an environment which promotes corrosion and oxidation.",
      "requirements": "Stable at high temperatures with good corrosion and oxidation resistance.",
      "texture_img": "images/parts/combusture.png",
      "correctMat": "titanium"
    },
    {
      "name": "turbine",
      "description": "The turbine components are the driving force of a jet engine. They rotate very fast, directly in the flow of burning fuel, reaching very high temperatures. As well as the high loads, under these conditions, corrosion and oxidation can occur.",
      "requirements": "The turbine components must be able to operate at very high temperatures under load. They must also be resistant to corrosion and oxidation.",
      "texture_img": "images/parts/turbine.png",
      "correctMat": "nickle"
    }
  ]
}


